In [1]:
import pandas as pd

# Datasets
## Deliveries 
Contains: purchase id, purchase timestamp, delivery timestamp, delivery company.   
Usage: Check the typical delivery time for your company after purchase.   
Questions: Why company name is a number, is it company id?

In [3]:
pd.read_json("./../data/raw/deliveries.jsonl", lines=True)

      purchase_id   purchase_timestamp   delivery_timestamp  delivery_company
0           20001  2021-01-06T22:50:03  2021-01-09T22:51:44             516.0
1           20002  2021-01-08T21:33:21  2021-01-13T21:35:21             360.0
2           20003  2021-01-07T23:48:32  2021-01-11T23:50:01             516.0
3           20004  2021-01-10T02:17:49  2021-01-15T02:20:55             360.0
4           20005  2021-01-06T08:05:00  2021-01-11T08:06:21             360.0
...           ...                  ...                  ...               ...
2775        22776  2021-01-01T09:08:39  2021-01-04T09:13:34             360.0
2776        22777  2021-01-03T00:04:24  2021-01-07T00:08:31             360.0
2777        22778  2021-01-02T19:16:35  2021-01-04T19:20:08             360.0
2778        22779  2021-01-01T03:11:58  2021-01-04T03:14:12             516.0
2779        22780  2021-01-01T05:37:15  2021-01-05T05:38:00             620.0

[2780 rows x 4 columns]

## Products
Contains: product id, product name, category path, price   
Usage:   
Questions: Why some prices are negative? What does it mean?

In [4]:
pd.read_json("./../data/raw/products.jsonl", lines=True)

,product_id,product_name,category_path,price
0,1001,Telefon Siemens Gigaset DA310,Telefony i akcesoria;Telefony stacjonarne,5.897000e+01
1,1002,Kyocera FS-1135MFP,Komputery;Drukarki i skanery;Biurowe urządzeni...,2.048500e+03
2,1003,Kyocera FS-3640MFP,Komputery;Drukarki i skanery;Biurowe urządzeni...,-7.639000e+03
3,1004,Fallout 3 (Xbox 360),Gry i konsole;Gry na konsole;Gry Xbox 360,4.999000e+01
4,1005,Szalone Króliki Na żywo i w kolorze (Xbox 360),Gry i konsole;Gry na konsole;Gry Xbox 360,4.999000e+01
...,...,...,...,...
314,1315,Jabra Talk,Telefony i akcesoria;Akcesoria telefoniczne;Ze...,5.499000e+01
315,1316,Plantronics Voyager Legend,Telefony i akcesoria;Akcesoria telefoniczne;Ze...,2.490000e+02
316,1317,Plantronics Savi W740,Telefony i akcesoria;Akcesoria telefoniczne;Ze...,1.303960e+09
317,1318,Plantronics Savi W710,Sprzęt RTV;Audio;Słuchawki,5.530000e+02
318,1319,HTC HS-S200,Telefony i akcesoria;Akcesoria telefoniczne;Ze...,1.499000e+01

## Sessions
Contains:
Usage:
Questions:

In [5]:
pd.read_json("./../data/raw/sessions.jsonl", lines=True)

,session_id,timestamp,user_id,product_id,event_type,offered_discount,purchase_id
0,100001,2021-01-10 16:32:24,102.0,1075.0,VIEW_PRODUCT,5,NaN
1,100001,2021-01-10 16:33:16,102.0,1079.0,VIEW_PRODUCT,5,NaN
2,100001,2021-01-10 16:37:18,102.0,1078.0,VIEW_PRODUCT,5,NaN
3,100001,2021-01-10 16:38:07,102.0,1077.0,VIEW_PRODUCT,5,NaN
4,100002,2021-01-06 22:28:51,102.0,1007.0,VIEW_PRODUCT,5,NaN
...,...,...,...,...,...,...,...
156858,109153,2021-01-01 05:27:44,299.0,1017.0,VIEW_PRODUCT,20,NaN
156859,109153,2021-01-01 05:31:55,299.0,1070.0,VIEW_PRODUCT,20,NaN
156860,109153,2021-01-01 05:32:32,299.0,1034.0,VIEW_PRODUCT,20,NaN
156861,109153,2021-01-01 05:36:26,299.0,1036.0,VIEW_PRODUCT,20,NaN
156862,109153,2021-01-01 05:37:15,299.0,1036.0,BUY_PRODUCT,20,22780.0

## Users
Contains:
Usage:
Questions:

In [7]:
pd.read_json("./../data/raw/users.jsonl", lines=True)

     user_id               name      city                       street
0        102       Borys Klatka  Szczecin          plac Kolorowa 28/81
1        103  Adrian Zdancewicz    Poznań        ulica Jagiellońska 09
2        104      Albert Choina    Gdynia            ulica Jaworowa 11
3        105  Dagmara Dawidczyk    Kraków           ulica Asnyka 87/26
4        106    Stefan Łuszczyk  Warszawa              aleja Ludowa 98
..       ...                ...       ...                          ...
195      297     Angelika Szoka     Radom               al. Sokola 282
196      298   Witold Sidorczuk   Wrocław            pl. Zacisze 62/54
197      299   Nicole Kryszczuk  Szczecin  aleja Żwirki i Wigury 63/58
198      300     Julita Białach    Kraków               ul. Rataja 866
199      301        Maks Kudela    Poznań               ul. Miłosza 63

[200 rows x 4 columns]